In [1]:
import pandas as pd
print('pandas version: ', pd.__version__)

pandas version:  1.2.4

In [3]:
dict_data = {'a': 1, 'b': 2,'c': 3}

sr = pd.Series(dict_data)
print(type(sr))
print('-'*50)
print(sr)

<class 'pandas.core.series.Series'>
--------------------------------------------------
a    1
b    2
c    3
dtype: int64

In [5]:
dict_data = {'학생1': '둘리', '학생2': '또치'}
s1 = pd.Series(dict_data)
s1

학생1    둘리
학생2    또치
dtype: object

In [6]:
s1['학생1']

'둘리'

In [7]:
s2 = pd.Series(['둘리','또치'])
s2

0    둘리
1    또치
dtype: object

In [8]:
s2[0]

'둘리'

In [9]:
s2 = pd.Series(['둘리', '또치'], index=['학생1', '학생2'])
s2

학생1    둘리
학생2    또치
dtype: object

In [11]:
s2['학생1'], s2[0]

('둘리', '둘리')

In [12]:
s2 = pd.Series([10, 20, 30, 40, 50, 60], index=['a','b','c','d','e','f'])
s2

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [13]:
tup_data = ('영인', '2020-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
sr

이름              영인
생년월일    2020-05-01
성별               여
학생여부          True
dtype: object

In [14]:
sr[0:3]

이름              영인
생년월일    2020-05-01
성별               여
dtype: object

In [16]:
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}

df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [17]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], index=['준서', '예은'], columns=['나이', '성별', '학교'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [18]:
df.index = ['학생1', '학생2']
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [19]:
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [23]:
df.rename(columns={'연령': '나이', '남녀': '성별'}, inplace=True)
df

     나이 성별   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [24]:
df.rename(index={'학생1': '준서', '학생2': '예은'}, inplace=True)
df

    나이 성별   소속
준서  15  남  덕영중
예은  17  여  수리중

In [25]:
exam_data = {'수학': [90, 80, 70], '영어': [98, 89, 95], '음악': [85,95,100], '체육': [100,90,90]}

df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [39]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [43]:
df.loc['서준']

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [56]:
df[0:3]

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [58]:
df2 = df[:]
df2.drop('우현', inplace=True)
df2

/Users/jaehyeong/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [67]:
df3 = df.copy()
df3.iloc[0][0] = 100
df3, df

(     수학  영어   음악   체육
 서준  100  98   85  100
 우현   80  89   95   90
 인아   70  95  100   90,
     수학  영어   음악   체육
 서준  90  98   85  100
 우현  80  89   95   90
 인아  70  95  100   90)

In [68]:
df3.drop(['우현','인아'], inplace=True)
df3

     수학  영어  음악   체육
서준  100  98  85  100